{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-Product",
    "2": "I-Product",
    "3": "B-LOC",
    "4": "I-LOC",
    "5": "B-PRICE",
    "6": "I-PRICE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-LOC": 3,
    "B-PRICE": 5,
    "B-Product": 1,
    "I-LOC": 4,
    "I-PRICE": 6,
    "I-Product": 2,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "vocab_size": 119547
}
